# Задание 1.
# Базовый каркас бота создан (bot.py, config.py).
# pip install telebot

# Задание 2.
# Регистрация бота через BotFather (название, описание, about, иконка),
# токен вставляется в config.py.

import telebot
from telebot.types import ReplyKeyboardMarkup, KeyboardButton
from config import TOKEN
import random

bot = telebot.TeleBot(TOKEN)

# Данные для ответов (Задание 3–4)

responses = {
    "Писатель": ["Хемингуэй", "Толстой", "Достоевский", "Булгаков", "Чехов"],
    "Поэт": ["Шекспир", "Пушкин", "Лермонтов", "Маяковский", "Есенин"],
    "Книга": [
        "Три товарища",
        "Война и мир",
        "Преступление и наказание",
        "Мастер и Маргарита",
        "Анна Каренина"
    ],
    "Монолог": [
        "Быть или не быть",
        "Прощай, оружие",
        "Я помню чудное мгновенье",
        "Онегин, введи меня",
        "Мы все в ответе за своих друзей"
    ]
}

# Кнопочная клавиатура
keyboard = ReplyKeyboardMarkup(resize_keyboard=True)
keyboard.add(
    KeyboardButton("Писатель"),
    KeyboardButton("Поэт"),
    KeyboardButton("Книга"),
    KeyboardButton("Монолог")
)


# /start — приветствие (Задание 1)
@bot.message_handler(commands=["start"])
def start_bot(message):
    bot.send_message(
        message.chat.id,
        "👋 **Привет!**\n\n"
        "📚 Я бот о **писателях, поэтах, книгах и монологах**.\n\n"
        "👇 **Выбери кнопку или напиши сообщение вручную:**\n"
        "**Писатель / Поэт / Книга / Монолог**",
        reply_markup=keyboard,
        parse_mode="Markdown"
    )


# /about — описание бота (Задание 2)
@bot.message_handler(commands=["about"])
def about_bot(message):
    bot.send_message(
        message.chat.id,
        "ℹ️ **О боте**\n\n"
        "🤖 Этот Telegram-бот показывает:\n"
        "✍️ фамилии **писателей**\n"
        "🖋️ фамилии **поэтов**\n"
        "📖 **книги**\n"
        "🎭 **литературные монологи**\n\n"
        "🎯 Ответы выбираются **случайным образом**.",
        parse_mode="Markdown"
    )


# Обработка текстовых сообщений (Задание 3–4)
@bot.message_handler(content_types=["text"])
def respond_to_message(message):
    user_text = message.text.strip().lower()

    # Поддержка ручного ввода и кнопок
    mapping = {
        "писатель": "Писатель",
        "поэт": "Поэт",
        "книга": "Книга",
        "монолог": "Монолог"
    }

    if user_text in mapping:
        key = mapping[user_text]
        answer = random.choice(responses[key])

        bot.send_message(
            message.chat.id,
            f"✨ **Случайный ответ:**\n\n📌 {answer}",
            reply_markup=keyboard,
            parse_mode="Markdown"
        )
    else:
        bot.send_message(
            message.chat.id,
            "🤔 **Я не понял сообщение**\n\n"
            "✍️ Напиши или выбери:\n"
            "**Писатель / Поэт / Книга / Монолог** 👇",
            reply_markup=keyboard,
            parse_mode="Markdown"
        )


# Запуск бота
print("✅ Бот запущен и работает!")
bot.infinity_polling()
