import telebot
import random
from telebot import types

import database
from config import TOKEN

bot = telebot.TeleBot(TOKEN)
database.create_table()

compliments = [
    "Ты сегодня великолепна 🌸",
    "У тебя отличный вкус ✨",
    "Ты умница 💡",
    "Ты умнее, чем думаешь! 🧩",
    "У тебя отличное аналитическое мышление 🧠",
    "Ты быстро схватываешь суть вещей ⚡",
    "Ты прекрасно справляешься с трудностями! 🛡️",
    "У тебя сильный характер 💪",
    "Ты не сдаёшься, даже когда сложно 🧗",
    "Ты делаешь реальные шаги вперёд 🚀",
    "Ты умеешь доводить дела до конца ✔️",
    "Ты многого уже достигла, и это заметно 🌱",
    "С тобой легко и приятно общаться 😊",
    "Ты умеешь слушать и понимать 🤝",
    "Ты создаёшь тёплую атмосферу вокруг себя ☀️",
    "Ты справляешься лучше, чем тебе кажется 💛",
    "Ты заслуживаешь гордиться собой ⭐",
    "Ты достойна уважения 👏",
    "Ты поднимаешь настроение 🌈",
    "От тебя чувствуется позитив ✨",
    "Ты настоящая молодец 🙌",
    "Ты уникальна по-своему 💎",
    "Ты делаешь мир чуточку лучше 🌍"
]


def main_keyboard():
    keyboard = types.ReplyKeyboardMarkup(resize_keyboard=True)
    keyboard.add("💖 Комплимент", "📜 История")
    return keyboard


@bot.message_handler(commands=["start"])
def start(message):
    bot.send_message(
        message.chat.id,
        "Я бот-комплимент 💕",
        reply_markup=main_keyboard()
    )


@bot.message_handler(func=lambda m: m.text == "💖 Комплимент")
def give_compliment(message):
    text = random.choice(compliments)
    database.save_compliment(message.from_user.id, text)
    bot.send_message(message.chat.id, text)


@bot.message_handler(func=lambda m: m.text == "📜 История")
def show_history(message):
    history_list = database.get_history(message.from_user.id)

    if not history_list:
        bot.send_message(message.chat.id, "История пуста")
    else:
        bot.send_message(message.chat.id, "\n".join(history_list))


bot.polling()
